<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 验证码设置
// +----------------------------------------------------------------------
return [
    //验证码过期时间（s）
    'expire'            =>  1800,
    //使用背景图片
    'useImgBg'          => false,
    //验证码字体大小(px)
    'fontSize'          => 30,
    //是否画混淆曲线
    'useCurve'          => false,
    //是否添加杂点
    'useNoise'          => true,
    //验证码图片高度，设置为0为自动计算
    'imageH'            => 0,
    //验证码图片宽度，设置为0为自动计算
    'imageW'            => 0,
    //验证码位数
    'length'            => 4,
    //验证码字体，不设置是随机获取
    'fontttf'           => '',
    //背景颜色
    'bg'                => [243, 251, 254],
    //验证成功后是否重置
    'reset'             => true,
];